marcolo-30/Proyecto2_RTOS/board/pin_mux.h
/*! @name PORTC9 (number 85), J1[16]/D7
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_T1_FGPIO FGPIOC             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_T1_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_T1_GPIO_PIN_MASK (1U << 9U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_T1_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_T1_PIN 9U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_T1_PIN_MASK (1U << 9U)      /*!<@brief PORT pin mask */
                                                   /* @} */

/*! @name PORTC13 (number 89), J2[1]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_E_FGPIO FGPIOC              /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_E_GPIO GPIOC                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_E_GPIO_PIN_MASK (1U << 13U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_E_PORT PORTC                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_E_PIN 13U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_E_PIN_MASK (1U << 13U)      /*!<@brief PORT pin mask */
                                                   /* @} */

/*! @name PORTC16 (number 90), J2[3]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_RW_FGPIO FGPIOC              /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_RW_GPIO GPIOC                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_RW_GPIO_PIN_MASK (1U << 16U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_RW_PORT PORTC                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_RW_PIN 16U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_RW_PIN_MASK (1U << 16U)      /*!<@brief PORT pin mask */
                                                    /* @} */

/*! @name PORTA7 (number 41), J2[5]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_RS_FGPIO FGPIOA             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_RS_GPIO GPIOA               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_RS_GPIO_PIN_MASK (1U << 7U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_RS_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_RS_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_RS_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                   /* @} */

/*! @name PORTE30 (number 27), J4[11]/DAC_OUT
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_D7_FGPIO FGPIOE              /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_D7_GPIO GPIOE                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_D7_GPIO_PIN_MASK (1U << 30U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_D7_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_D7_PIN 30U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_D7_PIN_MASK (1U << 30U)      /*!<@brief PORT pin mask */
                                                    /* @} */

/*! @name PORTB20 (number 66), J4[9]/CMP_OUT
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_D6_FGPIO FGPIOB              /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_D6_GPIO GPIOB                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_D6_GPIO_PIN_MASK (1U << 20U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_D6_PORT PORTB                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_D6_PIN 20U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_D6_PIN_MASK (1U << 20U)      /*!<@brief PORT pin mask */
                                                    /* @} */

/*! @name PORTE23 (number 21), J4[7]/DIFF_ADC1_DM
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_D5_FGPIO FGPIOE              /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_D5_GPIO GPIOE                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_D5_GPIO_PIN_MASK (1U << 23U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_D5_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_D5_PIN 23U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_D5_PIN_MASK (1U << 23U)      /*!<@brief PORT pin mask */
                                                    /* @} */

/*! @name PORTE21 (number 19), J4[3]/DIFF_ADC0_DM
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_D4_FGPIO FGPIOE              /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_D4_GPIO GPIOE                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_D4_GPIO_PIN_MASK (1U << 21U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_D4_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_D4_PIN 21U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_D4_PIN_MASK (1U << 21U)      /*!<@brief PORT pin mask */
                                                    /* @} */

/*! @name PORTB18 (number 64), J1[1]/I2S_TX_BCLK
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_S8_FGPIO FGPIOB              /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_S8_GPIO GPIOB                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_S8_GPIO_PIN_MASK (1U << 18U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_S8_PORT PORTB                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_S8_PIN 18U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_S8_PIN_MASK (1U << 18U)      /*!<@brief PORT pin mask */
                                                    /* @} */

/*! @name PORTB19 (number 65), J1[3]/I2S_TX_FS
  @{ */

