marcolo-30/Proyecto2_RTOS/board/pin_mux.h
/*! @name PORTE6 (number 7), J3[11]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_E6_FGPIO FGPIOE             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_E6_GPIO GPIOE               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_E6_GPIO_PIN_MASK (1U << 6U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_E6_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_E6_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_E6_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                   /* @} */

/*! @name PORTE16 (number 14), J3[9]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_E5_FGPIO FGPIOE              /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_E5_GPIO GPIOE                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_E5_GPIO_PIN_MASK (1U << 16U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_E5_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_E5_PIN 16U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_E5_PIN_MASK (1U << 16U)      /*!<@brief PORT pin mask */
                                                    /* @} */

/*! @name PORTE17 (number 15), J3[7]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_E4_FGPIO FGPIOE              /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_E4_GPIO GPIOE                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_E4_GPIO_PIN_MASK (1U << 17U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_E4_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_E4_PIN 17U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_E4_PIN_MASK (1U << 17U)      /*!<@brief PORT pin mask */
                                                    /* @} */

/*! @name PORTE18 (number 16), J3[5]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_E3_FGPIO FGPIOE              /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_E3_GPIO GPIOE                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_E3_GPIO_PIN_MASK (1U << 18U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_E3_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_E3_PIN 18U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_E3_PIN_MASK (1U << 18U)      /*!<@brief PORT pin mask */
                                                    /* @} */

/*! @name PORTE19 (number 17), J3[3]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_E2_FGPIO FGPIOE              /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_E2_GPIO GPIOE                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_E2_GPIO_PIN_MASK (1U << 19U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_E2_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_E2_PIN 19U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_E2_PIN_MASK (1U << 19U)      /*!<@brief PORT pin mask */
                                                    /* @} */

/*! @name PORTE31 (number 28), J3[1]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_E1_FGPIO FGPIOE              /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_E1_GPIO GPIOE                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_E1_GPIO_PIN_MASK (1U << 31U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_E1_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_E1_PIN 31U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_E1_PIN_MASK (1U << 31U)      /*!<@brief PORT pin mask */
                                                    /* @} */

/*! @name PORTE0 (number 1), J2[18]/D14
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_TX_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_TX_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_TX_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                   /* @} */

/*! @name PORTE1 (number 2), J2[20]/D15
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_RX_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_RX_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_RX_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                   /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
